In [64]:
import numpy as np 

import pandas as pd

data1= pd.read_csv("C:\\Users\\Administrator\\Python\\Jupiter notebooks\\Python Assignments\\DataSets\\airq.csv")

In [65]:
#1.	Fetch the observations for 9 day of June

data1.query('Month == 6 and Day == 9')

    Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
39          40   71.0    291.0  13.8    90      6    9

In [67]:
#2.	Find Average temperature for the month of June. 
zz=data1.query('Month == 6')
zz['Temp'].mean()

79.1

In [68]:
#3.	To which day of June has the least temperature
day=zz['Temp'].min()
day

65

In [69]:
#4.	Find Maximum Ozone value for the month of May
oz=data1.groupby("Month")
oz.Ozone.max()

Month
5    115.0
6     71.0
7    135.0
8    168.0
9     96.0
Name: Ozone, dtype: float64

In [70]:
#5.	Find the count of the missing values in the ozone column of the data set

sum(data1.Ozone.isnull().values.ravel())

37

In [71]:
#6.	Find out What is the mean of the Ozone column in this dataset
data1.Ozone.mean()

42.12931034482759

In [58]:
#7.	Find out which month has the highest temperature

data1[data1.Temp== data1.Temp.max()]['Month']

119    8
Name: Month, dtype: int64

In [72]:
#8.	Find out the wind value when the Ozone becomes maximum
data1[data1.Ozone==data1.Ozone.max()]['Wind']

116    3.4
Name: Wind, dtype: float64

In [73]:
#9.	Find out the months for which the airquality observations have been carried out
list(data1.Month.unique())

[5, 6, 7, 8, 9]

In [61]:
#10.	Find the Ozone and temperature values for the 1st observation of every month.

data1[data1.Day==1][['Day','Ozone','Temp']]

     Day  Ozone  Temp
0      1   41.0    67
31     1    NaN    78
61     1  135.0    84
92     1   39.0    81
123    1   96.0    91

In [74]:
#11.	Which day of which month corresponds to the least Ozone Value. 
data1[data1.Ozone==data1.Ozone.min()][['Day', 'Month']]

    Day  Month
20   21      5

In [75]:
#12.	Convert the temperature for all the observations to Centigrade scale
data1['temp_centi'] = ((data1.Temp - 32) * (5/9))
data1.head(n=5)

   Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day  temp_centi
0           1   41.0    190.0   7.4    67      5    1   19.444444
1           2   36.0    118.0   8.0    72      5    2   22.222222
2           3   12.0    149.0  12.6    74      5    3   23.333333
3           4   18.0    313.0  11.5    62      5    4   16.666667
4           5    NaN      NaN  14.3    56      5    5   13.333333